Reports/СправкаРасчетКалькуляцияСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетКалькуляцияСебестоимости</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализироватьНематериальныеСтатьиЗатрат</Name>
					<Comment>Детализировать нематериальные статьи затрат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/КлассыСчетовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>КлассыСчетовРасходов</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Класс8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Класс9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Класс8и9</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаРасчетКалькуляцияСебестоимости/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Функция СформироватьТекстЗапроса(НачалоПериода, Организация)

	ИспользуемыеКлассыСчетовРасходов = БухгалтерскийУчет.ПолучитьИспользуемыеКлассыСчетовРасходов(НачалоПериода, Организация);
	Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8и9 Тогда
		ТекстПодзапросаПрямыеЗатраты = "
			|(ВЫБРАТЬ
			|   Проводки8Класс.СубконтоДт1 КАК ПодразделениеПрямыхЗатрат,
			|   Проводки8Класс.СубконтоДт2 КАК НоменклатурнаяГруппаПрямыхЗатрат,
			|   Проводки8Класс.СубконтоДт3 КАК ЗатратыПрямыхЗатрат,
			|   ЕстьNULL(ИсходныеПроводки.СчетКт,Проводки8Класс.СчетКт) КАК КорСчетПрямыхЗатрат,
			|   ЕстьNULL(ИсходныеПроводки.СубконтоКт1,Проводки8Класс.СубконтоКт1) КАК КорСубконтоПрямыхЗатрат,
			|   СУММА(ЕстьNULL(ИсходныеПроводки.Сумма,Проводки8Класс.Сумма)) КАК СуммаПрямыхЗатрат,
			|   СУММА(ЕстьNULL(ИсходныеПроводки.СуммаНУДт,Проводки8Класс.СуммаНУДт)) КАК СуммаПрямыхЗатратНУ,
			|   СУММА(ЕстьNULL(ИсходныеПроводки.КоличествоКт,Проводки8Класс.КоличествоКт)) КАК КоличествоПрямыхЗатрат
			|ИЗ
			|   РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&НачДата, &КонДата, СчетДт В ИЕРАРХИИ(&СчетПрямЗатрат) 
			|                          И Организация = &Организация И (НЕ СчетКт В ИЕРАРХИИ (&Счет91)) 
			|                          И (НЕ СчетКт В ИЕРАРХИИ (&Счет24))) КАК Проводки8Класс
			|ЛЕВОЕ СОЕДИНЕНИЕ 
			|	(ВЫБРАТЬ
			|   	ХозрасчетныйДвиженияССубконто.СчетДт,
			|   	ХозрасчетныйДвиженияССубконто.СчетКт,
			|   	ХозрасчетныйДвиженияССубконто.СубконтоКт1,
			|   	ХозрасчетныйДвиженияССубконто.Регистратор,
			|   	ХозрасчетныйДвиженияССубконто.НомерСтроки,
			|   	ХозрасчетныйДвиженияССубконто.Сумма,
			|   	ХозрасчетныйДвиженияССубконто.СуммаНУДт,
			|   	ХозрасчетныйДвиженияССубконто.КоличествоКт
			|	ИЗ
			|		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&НачДата, &КонДата, Организация = &Организация 
			|                          И (СчетДт В ИЕРАРХИИ (&СчетЗатратыПоЭлементам))) КАК ХозрасчетныйДвиженияССубконто
			|	) КАК ИсходныеПроводки
			|
			|ПО 
			|	Проводки8Класс.Регистратор = ИсходныеПроводки.Регистратор 
			|	И Проводки8Класс.НомерИсходнойПроводки = ИсходныеПроводки.НомерСтроки - 1
			|	И Проводки8Класс.Сумма = ИсходныеПроводки.Сумма 
			|	И Проводки8Класс.СчетКт = ИсходныеПроводки.СчетДт 
	        |
			|СГРУППИРОВАТЬ ПО	
			|   Проводки8Класс.СубконтоДт1,
			|   Проводки8Класс.СубконтоДт2,
			|   Проводки8Класс.СубконтоДт3,
			|   ЕстьNULL(ИсходныеПроводки.СчетКт,Проводки8Класс.СчетКт),
			|   ЕстьNULL(ИсходныеПроводки.СубконтоКт1,Проводки8Класс.СубконтоКт1)
			|
			|) КАК ПрямыеЗатраты
			|";
		
	Иначе
		ТекстПодзапросаПрямыеЗатраты = "
			|		(ВЫБРАТЬ
			|			ХозрасчетныйОбороты.Субконто1 КАК ПодразделениеПрямыхЗатрат,
			|			ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппаПрямыхЗатрат,
			|			ХозрасчетныйОбороты.Субконто3 КАК ЗатратыПрямыхЗатрат,
			|			ХозрасчетныйОбороты.КорСчет КАК КорСчетПрямыхЗатрат,
			|			ХозрасчетныйОбороты.КорСубконто1 КАК КорСубконтоПрямыхЗатрат,
			|			ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаПрямыхЗатрат,
			|			ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаПрямыхЗатратНУ,
			|			ХозрасчетныйОбороты.КоличествоКорОборот КАК КоличествоПрямыхЗатрат
			|		ИЗ
			|			РегистрБухгалтерии.Хозрасчетный.Обороты(
			|				&НачДата,
			|				&КонДата,
			|				,
			|				Счет В ИЕРАРХИИ (&СчетПрямЗатрат),
			|				,
			|				Организация = &Организация,
			|				(НЕ(КорСчет В ИЕРАРХИИ (&Счет91) ИЛИ КорСчет В ИЕРАРХИИ (&Счет24))),
			|				) КАК ХозрасчетныйОбороты) КАК ПрямыеЗатраты
			|";
	КонецЕсли; 	
	
	
Текст	= "ВЫБРАТЬ
     	  |	Выпуск.ПодразделениеВыпуска КАК Подразделение,
     	  |	Выпуск.НоменклатурнаяГруппаВыпуска КАК НоменклатурнаяГруппа,
     	  |	Выпуск.НоменклатураВыпуска КАК Номенклатура,
     	  |	ПрямыеЗатраты.ЗатратыПрямыхЗатрат КАК ПрямыеЗатраты,
		  |	ПрямыеЗатраты.КорСчетПрямыхЗатрат КАК КорСчетПрямыхЗатрат,
    	  |ВЫБОР КОГДА ПрямыеЗатраты.КорСчетПрямыхЗатрат В (&СписокСчетовУчетаНоменклатуры) ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК МатериальныеЗатраты,
     	  |	ПрямыеЗатраты.КорСубконтоПрямыхЗатрат КАК НоменклатураПрямыхЗатрат,
      	  |	ЗатратыНаБрак.Затраты24 КАК Затраты24,
     	  |	ОбщеПроизводственныеЗатраты.Затраты91 КАК Затраты91,
     	  |	ЕСТЬNULL(Выпуск.КоличествоВыпуска, 0) КАК Количество,
     	  |	ЕСТЬNULL(ПрямыеЗатраты.КоличествоПрямыхЗатрат, 0) КАК КоличествоПрямыхЗатрат,
     	  |	ЕСТЬNULL(Выпуск.ОбщаяСуммаВыпуска, 0) КАК ОбщаяСуммаВыпуска,
		  |	ЕСТЬNULL(Выпуск.ОбщаяСуммаВыпускаНУ, 0) КАК ОбщаяСуммаВыпускаНУ,
     	  |	ЕСТЬNULL(Выпуск.СуммаВыпуска, 0) КАК Сумма,
		  |	ЕСТЬNULL(Выпуск.СуммаВыпускаНУ, 0) КАК СуммаНУ,
     	  |	ЕСТЬNULL(ПрямыеЗатраты.СуммаПрямыхЗатрат, 0) КАК СуммаПрямыхЗатрат,
		  |	ЕСТЬNULL(ПрямыеЗатраты.СуммаПрямыхЗатратНУ, 0) КАК СуммаПрямыхЗатратНУ,
     	  |	ЕСТЬNULL(НЗП.НачОст, 0) КАК НачОстНЗП,
		  |	ЕСТЬNULL(НЗП.НачОстНУ, 0) КАК НачОстНЗПНУ,
     	  |	ЕСТЬNULL(НЗП.КонОст, 0) КАК КонОстНЗП,
		  |	ЕСТЬNULL(НЗП.КонОстНУ, 0) КАК КонОстНЗПНУ,
     	  |	ЕСТЬNULL(ЗатратыНаБрак.Сумма24, 0) КАК Сумма24,
		  |	ЕСТЬNULL(ЗатратыНаБрак.Сумма24НУ, 0) КАК Сумма24НУ,
     	  |	ЕСТЬNULL(ОбщеПроизводственныеЗатраты.Сумма91, 0) КАК Сумма91,
		  |	ЕСТЬNULL(ОбщеПроизводственныеЗатраты.Сумма91НУ, 0) КАК Сумма91НУ
     	  |ИЗ
     	  |	(ВЫБРАТЬ
     	  |		ХозрасчетныйОбороты.Субконто1 КАК ПодразделениеВыпуска,
     	  |		ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппаВыпуска,
     	  |		ХозрасчетныйОбороты.КорСубконто1 КАК НоменклатураВыпуска,
     	  |		ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаВыпуска,
		  |		ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаВыпускаНУ,
     	  |		-ХозрасчетныйОбороты.КоличествоКорОборот КАК КоличествоВыпуска,
     	  |		ХозрасчетныйОбороты.СуммаОборотКт КАК ОбщаяСуммаВыпуска,
		  |		ХозрасчетныйОбороты.СуммаНУОборотКт КАК ОбщаяСуммаВыпускаНУ
     	  |	ИЗ
     	  |		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты) КАК Выпуск
		  |		ЛЕВОЕ СОЕДИНЕНИЕ " + ТекстПодзапросаПрямыеЗатраты + " 
     	  |		ПО Выпуск.ПодразделениеВыпуска = ПрямыеЗатраты.ПодразделениеПрямыхЗатрат
     	  |			И Выпуск.НоменклатурнаяГруппаВыпуска = ПрямыеЗатраты.НоменклатурнаяГруппаПрямыхЗатрат
     	  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
     	  |			ХозрасчетныйОбороты.Субконто1 КАК Подразделение91,
     	  |			ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппа91,
     	  |			ХозрасчетныйОбороты.Субконто3 КАК Затраты91,
     	  |			ХозрасчетныйОбороты.СуммаОборотДт КАК Сумма91,
		  |			ХозрасчетныйОбороты.СуммаНУОборотДт КАК Сумма91НУ
     	  |		ИЗ
     	  |			РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация, КорСчет В ИЕРАРХИИ (&Счет91), ) КАК ХозрасчетныйОбороты) КАК ОбщеПроизводственныеЗатраты
     	  |		ПО Выпуск.ПодразделениеВыпуска = ОбщеПроизводственныеЗатраты.Подразделение91
     	  |			И Выпуск.НоменклатурнаяГруппаВыпуска = ОбщеПроизводственныеЗатраты.НоменклатурнаяГруппа91
    	  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
      	  |			ХозрасчетныйОбороты.Субконто1 КАК Подразделение24,
      	  |			ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппа24,
      	  |			ХозрасчетныйОбороты.Субконто3 КАК Затраты24,
      	  |			ХозрасчетныйОбороты.СуммаОборотДт КАК Сумма24,
		  |			ХозрасчетныйОбороты.СуммаНУОборотДт КАК Сумма24НУ
      	  |		ИЗ
      	  |			РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация, КорСчет В ИЕРАРХИИ (&Счет24), ) КАК ХозрасчетныйОбороты) КАК ЗатратыНаБрак
      	  |		ПО Выпуск.ПодразделениеВыпуска = ЗатратыНаБрак.Подразделение24
      	  |			И Выпуск.НоменклатурнаяГруппаВыпуска = ЗатратыНаБрак.НоменклатурнаяГруппа24
     	  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
     	  |			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК НачОст,
		  |			ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК НачОстНУ,
     	  |			ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК КонОст,
		  |			ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстаток КАК КонОстНУ,
     	  |			ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ПодразделениеНЗП,
     	  |			ХозрасчетныйОстаткиИОбороты.Субконто2 КАК НоменклатурнаяГруппаНЗП
     	  |		ИЗ
     	  |			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачДата, &КонДата, , , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты) КАК НЗП
     	  |		ПО Выпуск.НоменклатурнаяГруппаВыпуска = НЗП.НоменклатурнаяГруппаНЗП
     	  |			И Выпуск.ПодразделениеВыпуска = НЗП.ПодразделениеНЗП
		  |
		  |	УПОРЯДОЧИТЬ ПО
    	  |		ВЫБОР КОГДА ПрямыеЗатраты.КорСчетПрямыхЗатрат В (&СписокСчетовУчетаНоменклатуры) ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
		  |
     	  |ИТОГИ
     	  |	МАКСИМУМ(Количество),
     	  |	МАКСИМУМ(КоличествоПрямыхЗатрат),
     	  |	СУММА(ОбщаяСуммаВыпуска),
		  |	СУММА(ОбщаяСуммаВыпускаНУ),
     	  |	МАКСИМУМ(Сумма),
		  |	МАКСИМУМ(СуммаНУ),
     	  |	МАКСИМУМ(СуммаПрямыхЗатрат),
		  |	МАКСИМУМ(СуммаПрямыхЗатратНУ),
     	  |	МАКСИМУМ(НачОстНЗП),
		  |	МАКСИМУМ(НачОстНЗПНУ),
     	  |	МАКСИМУМ(КонОстНЗП),
		  |	МАКСИМУМ(КонОстНЗПНУ),
     	  |	МАКСИМУМ(Сумма24),
		  |	МАКСИМУМ(Сумма24НУ),
     	  |	МАКСИМУМ(Сумма91),
		  |	МАКСИМУМ(Сумма91НУ)
     	  |ПО
     	  |	Подразделение,
     	  |	НоменклатурнаяГруппа,
     	  |	Номенклатура,
     	  |	ПрямыеЗатраты,
     	  |	КорСчетПрямыхЗатрат,
     	  |	НоменклатураПрямыхЗатрат,
     	  |	Затраты24,
     	  |	Затраты91
		  |";
Возврат Текст;


КонецФункции


Процедура ВывестиОбласть(ДокументРезультат, ОбластьОсновная, ОбластьОкончание, Уровень, ИмяГруппы, Открыта, ИмяПараметра, Выборка)
	
	Если Уровень = 0 Тогда
		ОбластьНачало = ДокументРезультат.Вывести(ОбластьОсновная);
	Иначе
		ОбластьНачало = ДокументРезультат.Вывести(ОбластьОсновная, Уровень, ИмяГруппы, Открыта);
	КонецЕсли;
	
	Если Уровень = 0 Тогда
		ОбластьКонец = ДокументРезультат.Присоединить(ОбластьОкончание);
	Иначе
		
		ОбластьКонец = ДокументРезультат.Присоединить(ОбластьОкончание, Уровень, ИмяГруппы, Открыта);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт

	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);

	ДокументРезультат.Очистить();

	Макет      = ПолучитьМакет("Отчет");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
    МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
	// 37490 <<
	МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>

	ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
	
	ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ФП = Истина");
	ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
	ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецДня(ДатаКон);
	ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Калькуляция себестоимости продукции (бухгалтерский учет)';uk='Калькуляція собівартості продукції (бухгалтерський облік)'", КодЯзыкаПечать);
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
	
    

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",     Новый Граница(НачалоДня(ДатаНач), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата",     Новый Граница(КонецДня(ДатаКон),  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("СчетПрямЗатрат",  СписокСчетов);
	Запрос.УстановитьПараметр("Счет91",  ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("Счет24",  ПланыСчетов.Хозрасчетный.БракВПроизводстве);
	
    Если БухгалтерскийУчет.ПолучитьИспользоватьКлассыСчетовВКачествеГрупп() Тогда
		СчетЗатратыПоЭлементам 		= ПланыСчетов.Хозрасчетный.ЗатратыПоЭлементам;
	Иначе
		СчетЗатратыПоЭлементам	= Новый Массив;
		СчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЗатраты);
		СчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда);
		СчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия);
		СчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.Амортизация);
		СчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты);
		СчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам);
	КонецЕсли;
	Запрос.УстановитьПараметр("СчетЗатратыПоЭлементам",  СчетЗатратыПоЭлементам);
	
	ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
	
	Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
		
		ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
		
	КонецЕсли;
	
	Запрос.Текст = СформироватьТекстЗапроса(НачалоПериода, Организация);
   				   
	Запрос.Текст  = СтрЗаменить(Запрос.Текст, ", , ) КАК ХозрасчетныйОбороты","" + ОграниченияПоПостроителюОтчета + ", , ) КАК ХозрасчетныйОбороты");
	Запрос.Текст  = СтрЗаменить(Запрос.Текст, ", , ) КАК ВыпускБУ","" + ОграниченияПоПостроителюОтчета + ", , ) КАК ВыпускБУ");
	
	СписокСчетовУчетаНоменклатуры = СписокСчетовУчетаНоменклатуры("Бух");
	ЗапросСчета = Новый Запрос;
	ЗапросСчета.УстановитьПараметр("Счета", СписокСчетовУчетаНоменклатуры);
	ЗапросСчета.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счета)";
	
	Счета = ЗапросСчета.Выполнить().Выгрузить();
	СписокСчетовУчетаНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Счет Из Счета Цикл
		Если СписокСчетовУчетаНоменклатуры.НайтиПоЗначению(Счет.Ссылка) = Неопределено Тогда
			СписокСчетовУчетаНоменклатуры.Добавить(Счет.Ссылка);
		КонецЕсли; 
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокСчетовУчетаНоменклатуры",  СписокСчетовУчетаНоменклатуры);
	
	Результат = Запрос.Выполнить();
	
	СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
	Если Не ПустаяСтрока(СтрОтбор) Тогда
		ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");                     
		ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + СтрОтбор;
		ДокументРезультат.Вывести(ОбластьОтбор);
	КонецЕсли;	
	
	ОбластьШапка              = Макет.ПолучитьОбласть("Шапка|Основная");
	ОбластьСтрокаЗатрат       = Макет.ПолучитьОбласть("СтрокаЗатрат|Основная");
	ОбластьСчетЗатрат         = Макет.ПолучитьОбласть("СчетЗатрат|Основная");
	ОбластьНоменклатураЗатрат = Макет.ПолучитьОбласть("СтрокаНоменклатурыЗатрат|Основная");
	
	ОбластьШапка23            = Макет.ПолучитьОбласть("Шапка23|Основная");
	ОбластьШапка91            = Макет.ПолучитьОбласть("Шапка91|Основная");
	ОбластьШапка24            = Макет.ПолучитьОбласть("Шапка24|Основная");
	ОбластьИтого23            = Макет.ПолучитьОбласть("Итого23|Основная");
	ОбластьИтого91            = Макет.ПолучитьОбласть("Итого91|Основная");
	ОбластьИтого24            = Макет.ПолучитьОбласть("Итого24|Основная");
	ОбластьНЗПНач             = Макет.ПолучитьОбласть("НЗПНач|Основная");
	ОбластьНЗПКон             = Макет.ПолучитьОбласть("НЗПКон|Основная");
	ОбластьНЗПИтого           = Макет.ПолучитьОбласть("НЗПИтого|Основная");
	ОбластьОкончаниеТаблицы   = Макет.ПолучитьОбласть("ОкончаниеТаблицы|Основная");
	ОбластьШапкаОкончание              = Макет.ПолучитьОбласть("Шапка|Окончание");
	ОбластьСтрокаЗатратОкончание       = Макет.ПолучитьОбласть("СтрокаЗатрат|Окончание");
	ОбластьСчетЗатратОкончание         = Макет.ПолучитьОбласть("СчетЗатрат|Окончание");
	ОбластьНоменклатураЗатратОкончание = Макет.ПолучитьОбласть("СтрокаНоменклатурыЗатрат|Окончание");
	ОбластьШапка23Окончание            = Макет.ПолучитьОбласть("Шапка23|Окончание");
	ОбластьШапка91Окончание            = Макет.ПолучитьОбласть("Шапка91|Окончание");
	ОбластьШапка24Окончание            = Макет.ПолучитьОбласть("Шапка24|Окончание");
	ОбластьИтого23Окончание            = Макет.ПолучитьОбласть("Итого23|Окончание");
	ОбластьИтого91Окончание            = Макет.ПолучитьОбласть("Итого91|Окончание");
	ОбластьИтого24Окончание            = Макет.ПолучитьОбласть("Итого24|Окончание");
	ОбластьНЗПНачОкончание             = Макет.ПолучитьОбласть("НЗПНач|Окончание");
	ОбластьНЗПКонОкончание             = Макет.ПолучитьОбласть("НЗПКон|Окончание");
	ОбластьНЗПИтогоОкончание           = Макет.ПолучитьОбласть("НЗПИтого|Окончание");
	ОбластьОкончаниеТаблицыОкончание   = Макет.ПолучитьОбласть("ОкончаниеТаблицы|Окончание");
	
	ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
	
	
	
	ВыборкаПодразделение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	
	Пока ВыборкаПодразделение.Следующий() Цикл		
		ВыборкаНоменклатурнаяГруппа = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатурнаяГруппа");
		
		Пока ВыборкаНоменклатурнаяГруппа.Следующий() Цикл
			ВсегоВыпуск   = ВыборкаНоменклатурнаяГруппа.ОбщаяСуммаВыпуска;
			ВсегоВыпускНУ   = ВыборкаНоменклатурнаяГруппа.ОбщаяСуммаВыпускаНУ;
			Если ВсегоВыпуск = 0 И ВсегоВыпускНУ = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаНоменклатураВыпуска = ВыборкаНоменклатурнаяГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
			
			Пока ВыборкаНоменклатураВыпуска.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатураВыпуска.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаВыпуска   = ВыборкаНоменклатураВыпуска.ОбщаяСуммаВыпуска;
				СуммаВыпускаНУ   = ВыборкаНоменклатураВыпуска.ОбщаяСуммаВыпускаНУ;
				
				Если СуммаВыпуска = 0 И СуммаВыпускаНУ = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Коэффициент   = ?(ВсегоВыпуск = 0, 0, СуммаВыпуска / ВсегоВыпуск);
				КоэффициентНУ   = ?(ВсегоВыпускНУ = 0, 0, СуммаВыпускаНУ / ВсегоВыпускНУ);
								
				ОбластьШапка.Параметры.НоменклатураВыпуска         = УправлениеПроизводством.ВыводНаименованияВыпуска(ВыборкаНоменклатураВыпуска.Номенклатура);
				ОбластьШапка.Параметры.АналитикаВыпуска            = "" + ВыборкаНоменклатураВыпуска.Подразделение + " / " + ВыборкаНоменклатураВыпуска.НоменклатурнаяГруппа;
				ОбластьШапка.Параметры.КоличествоВыпуска           = ВыборкаНоменклатураВыпуска.Количество;
				ОбластьШапка.Параметры.СуммаВыпуска                =  ?(ВыборкаНоменклатураВыпуска.Количество = 0, 0, ВыборкаНоменклатураВыпуска.Сумма);
				ОбластьШапка.Параметры.СуммаВыпускаНУ              =  ?(ВыборкаНоменклатураВыпуска.Количество = 0, 0, ВыборкаНоменклатураВыпуска.СуммаНУ);
				ОбластьШапка.Параметры.ЦенаВыпуска                 = ?(ВыборкаНоменклатураВыпуска.Количество = 0, ВыборкаНоменклатураВыпуска.Сумма, ВыборкаНоменклатураВыпуска.Сумма / ВыборкаНоменклатураВыпуска.Количество);
				ОбластьШапка.Параметры.ЦенаВыпускаНУ                 = ?(ВыборкаНоменклатураВыпуска.Количество = 0, ВыборкаНоменклатураВыпуска.СуммаНУ, ВыборкаНоменклатураВыпуска.СуммаНУ / ВыборкаНоменклатураВыпуска.Количество);
				ОбластьШапка.Параметры.ТекстКоличество             = ?(ВыборкаНоменклатураВыпуска.Количество = 0, "", НСтр("ru='Количество выпуска:';uk='Кількість випуску:'", КодЯзыкаПечать));
				ОбластьШапка.Параметры.ТекстСумма                  = ?(ВыборкаНоменклатураВыпуска.Количество = 0, "", НСтр("ru='Факт. стоимость выпуска:';uk='Факт. вартість випуску:'", КодЯзыкаПечать));
				ОбластьШапка.Параметры.СебестоимостьЕдиницы        = НСтр("ru='Себестоимость ед.';uk='Собівартість од.'", КодЯзыкаПечать);
                ВывестиОбласть(ДокументРезультат, ОбластьШапка, ОбластьШапкаОкончание, 1, "Группа1", Ложь, "Сумма", ВыборкаНоменклатураВыпуска);

                ВывестиОбласть(ДокументРезультат, ОбластьШапка23, ОбластьШапка23Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
				ВыборкаПрямыеЗатраты = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПрямыеЗатраты");
				
				ИтогоСуммаЗатрат23 = 0;
				ИтогоСуммаЗатрат23НУ = 0;
				
				Пока ВыборкаПрямыеЗатраты.Следующий() Цикл
					
					Если ВыборкаПрямыеЗатраты.СуммаПрямыхЗатрат = 0 И ВыборкаПрямыеЗатраты.СуммаПрямыхЗатратНУ = 0 Тогда
						Продолжить;
					КонецЕсли;
					ВыборкаНоменклатураЗатрат = ВыборкаПрямыеЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
					СуммаПрямыхЗатрат   = 0;
					СуммаПрямыхЗатратНУ   = 0;
					Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
						СуммаПрямыхЗатрат = СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат;
						СуммаПрямыхЗатратНУ = СуммаПрямыхЗатратНУ + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНУ;
					КонецЦикла;
					
					ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = ВыборкаПрямыеЗатраты.ПрямыеЗатраты;
					ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат = СуммаПрямыхЗатрат * Коэффициент;
					ОбластьСтрокаЗатрат.Параметры.СуммаЗатратНУ = СуммаПрямыхЗатратНУ * КоэффициентНУ;
                    ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 2, "Группа2", Ложь, "СуммаЗатрат", ВыборкаПрямыеЗатраты);
					
					ВыборкаСчетПрямыхЗатрат = ВыборкаПрямыеЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КорСчетПрямыхЗатрат");
					
					Пока ВыборкаСчетПрямыхЗатрат.Следующий() Цикл
						
						Если ВыборкаСчетПрямыхЗатрат.СуммаПрямыхЗатрат = 0 Тогда
							Продолжить;
						КонецЕсли;
						
					ВыборкаНоменклатураЗатрат = ВыборкаСчетПрямыхЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
					СуммаПрямыхЗатрат = 0;
					СуммаПрямыхЗатратНУ = 0;
					Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
						СуммаПрямыхЗатрат = СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат;
						СуммаПрямыхЗатратНУ = СуммаПрямыхЗатратНУ + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНУ;
					КонецЦикла;
						
						ОбластьСчетЗатрат.Параметры.НаименованиеСчетаЗатрат = РазъяснитьЗатраты(ВыборкаСчетПрямыхЗатрат.КорСчетПрямыхЗатрат, КодЯзыкаПечать);
						ОбластьСчетЗатрат.Параметры.СуммаСчетаЗатрат = СуммаПрямыхЗатрат * Коэффициент;
						ОбластьСчетЗатрат.Параметры.СуммаСчетаЗатратНУ = СуммаПрямыхЗатратНУ * КоэффициентНУ;
                        ВывестиОбласть(ДокументРезультат, ОбластьСчетЗатрат, ОбластьСчетЗатратОкончание, 3, "Группа3", Ложь, "СуммаСчетаЗатрат", ВыборкаСчетПрямыхЗатрат);
						
						ВыборкаНоменклатураЗатрат = ВыборкаСчетПрямыхЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
						
						МатериальныеЗатраты = (ВыборкаСчетПрямыхЗатрат.МатериальныеЗатраты = 0);
						
						Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
							
							ОбластьНоменклатураЗатрат.Параметры.НаименованиеНоменклатурыЗатрат = УправлениеПроизводством.ВыводНаименованияВыпуска(ВыборкаНоменклатураЗатрат.НоменклатураПрямыхЗатрат);
							ОбластьНоменклатураЗатрат.Параметры.СуммаНоменклатурыЗатрат        = ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат * Коэффициент;
							ОбластьНоменклатураЗатрат.Параметры.СуммаНоменклатурыЗатратНУ        = ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНУ * КоэффициентНУ;
							ОбластьНоменклатураЗатрат.Параметры.КоличествоНоменклатурыЗатрат   = ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат * Коэффициент;
							ОбластьНоменклатураЗатрат.Параметры.ЦенаНоменклатурыЗатрат         = ?(ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат = 0, 0, ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат / ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат);
							ОбластьНоменклатураЗатрат.Параметры.ЦенаНоменклатурыЗатратНУ         = ?(ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат = 0, 0, ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНУ / ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат);
							Если МатериальныеЗатраты ИЛИ ДетализироватьНематериальныеСтатьиЗатрат  Тогда
								ВывестиОбласть(ДокументРезультат, ОбластьНоменклатураЗатрат, ОбластьНоменклатураЗатратОкончание, 4, "Группа4", Ложь, "СуммаНоменклатурыЗатрат", ВыборкаНоменклатураЗатрат);
							КонецЕсли; 
							
							ИтогоСуммаЗатрат23 = ИтогоСуммаЗатрат23 + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат * Коэффициент;
							ИтогоСуммаЗатрат23НУ = ИтогоСуммаЗатрат23НУ + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНУ * КоэффициентНУ;
							
						КонецЦикла; // НоменклатураЗатрат
						
					КонецЦикла; // СчетЗатрат
				КонецЦикла;  // ПрямыеЗатраты
				
				ОбластьИтого23.Параметры.ИтогоСуммаЗатрат23 = ИтогоСуммаЗатрат23;
				ОбластьИтого23.Параметры.ИтогоСуммаЗатрат23НУ = ИтогоСуммаЗатрат23НУ;
			    ВывестиОбласть(ДокументРезультат, ОбластьИтого23, ОбластьИтого23Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат23", ВыборкаСчетПрямыхЗатрат);
				
				Всего91 = ВыборкаНоменклатураВыпуска.Сумма91;
				Всего91НУ = ВыборкаНоменклатураВыпуска.Сумма91НУ;
				ВсегоСуммаЗатрат   = 0;
				ВсегоСуммаЗатратНУ   = 0;
				Если НЕ Всего91 = 0 ИЛИ НЕ Всего91НУ = 0 Тогда
			        ВывестиОбласть(ДокументРезультат, ОбластьШапка91, ОбластьШапка91Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
					Выборка91 = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Затраты91");
					Пока Выборка91.Следующий() Цикл
						ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = Выборка91.Затраты91;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат        = Выборка91.Сумма91 * Коэффициент;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатратНУ        = Выборка91.Сумма91НУ * КоэффициентНУ;
						ВсегоСуммаЗатрат = ВсегоСуммаЗатрат + Выборка91.Сумма91 * Коэффициент;
						ВсегоСуммаЗатратНУ = ВсегоСуммаЗатратНУ + Выборка91.Сумма91НУ * КоэффициентНУ;
                        ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 0, 0, Ложь, "СуммаЗатрат", Выборка91);
					КонецЦикла; 					
					ОбластьИтого91.Параметры.ИтогоСуммаЗатрат91        = ВсегоСуммаЗатрат;
					ОбластьИтого91.Параметры.ИтогоСуммаЗатрат91НУ        = ВсегоСуммаЗатратНУ;
			        ВывестиОбласть(ДокументРезультат, ОбластьИтого91, ОбластьИтого91Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат91", Выборка91);
				КонецЕсли;  // Затраты91
				
				Всего24 = ВыборкаНоменклатураВыпуска.Сумма24;
				Всего24НУ = ВыборкаНоменклатураВыпуска.Сумма24НУ;
				ВсегоСуммаЗатрат   = 0;
				ВсегоСуммаЗатратНУ   = 0;
				Если НЕ Всего24 = 0 ИЛИ НЕ Всего24НУ = 0 Тогда
			        ВывестиОбласть(ДокументРезультат, ОбластьШапка24, ОбластьШапка24Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
					Выборка24 = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Затраты24");
					Пока Выборка24.Следующий() Цикл
						ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = Выборка24.Затраты24;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат        = Выборка24.Сумма24 * Коэффициент;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатратНУ        = Выборка24.Сумма24НУ * КоэффициентНУ;
						ВсегоСуммаЗатрат = ВсегоСуммаЗатрат + Выборка24.Сумма24 * Коэффициент;
						ВсегоСуммаЗатратНУ = ВсегоСуммаЗатратНУ + Выборка24.Сумма24НУ * КоэффициентНУ;
                        ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 0, 0, Ложь, "СуммаЗатрат", Выборка24);
					КонецЦикла; 					
					ОбластьИтого24.Параметры.ИтогоСуммаЗатрат24        = ВсегоСуммаЗатрат;
					ОбластьИтого24.Параметры.ИтогоСуммаЗатрат24НУ        = ВсегоСуммаЗатратНУ;
			        ВывестиОбласть(ДокументРезультат, ОбластьИтого24, ОбластьИтого24Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат24", Выборка24);
				КонецЕсли;  // Затраты91
				
				
				НачОстНЗП   = ВыборкаНоменклатураВыпуска.НачОстНЗП   * Коэффициент;
				НачОстНЗПНУ   = ВыборкаНоменклатураВыпуска.НачОстНЗПНУ   * КоэффициентНУ;
				КонОстНЗП   = ВыборкаНоменклатураВыпуска.КонОстНЗП   * Коэффициент;
				КонОстНЗПНУ   = ВыборкаНоменклатураВыпуска.КонОстНЗПНУ   * КоэффициентНУ;
				
				Если НачОстНЗП <> 0 ИЛИ НачОстНЗПНУ <> 0 ИЛИ КонОстНЗП <> 0 ИЛИ КонОстНЗПНУ <> 0 Тогда
					   
					ОбластьНЗПНач.Параметры.СуммаНЗПнаНачало   = НачОстНЗП;
					ОбластьНЗПНач.Параметры.СуммаНЗПнаНачалоНУ = НачОстНЗПНУ;
					ОбластьНЗПКон.Параметры.СуммаНЗПнаКонец    = КонОстНЗП;
					ОбластьНЗПКон.Параметры.СуммаНЗПнаКонецНУ  = КонОстНЗПНУ;
					ОбластьНЗПИтого.Параметры.ИтогоНЗП         = НачОстНЗП - КонОстНЗП;
					ОбластьНЗПИтого.Параметры.ИтогоНЗПНУ       = НачОстНЗПНУ - КонОстНЗПНУ;
					ОбластьНЗПНач.Параметры.НачалоПериода	   = ДатаНач;
					ОбластьНЗПКон.Параметры.КонецПериода	   = ДатаКон;
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПНач,  ОбластьНЗПНачОкончание, 2, "Группа2", Ложь, "НачОстНЗП", ВыборкаНоменклатураВыпуска);
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПКон,  ОбластьНЗПКонОкончание, 2, "Группа2", Ложь, "КонОстНЗП", ВыборкаНоменклатураВыпуска);
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПИтого, ОбластьНЗПИтогоОкончание, 2, "Группа2", Ложь, "ИтогоНЗП", ВыборкаНоменклатураВыпуска);
				КонецЕсли;  // НЗП
				
			    ВывестиОбласть(ДокументРезультат, ОбластьОкончаниеТаблицы,  ОбластьОкончаниеТаблицыОкончание, 1, "Группа1", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
			КонецЦикла;  // НоменклатураВыпуска

		КонецЦикла;   // НоменклатурнаяГруппа
	КонецЦикла;    // Подразделение
	
	ОбластьПодвал.Параметры.ТекстПримечания = "";

	ДокументРезультат.Вывести(ОбластьПодвал);
	
	ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
	
	ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
	
	// Зафиксируем заголовок отчета
	ДокументРезультат.ФиксацияСверху = ВысотаЗаголовка + 1;

	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Калькуляция себестоимости';uk='Калькуляція собівартості'", КодЯзыкаПечать);

	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры // СформироватьОтчет

Функция РазъяснитьЗатраты(СчетЗатрат, КодЯзыкаПечать)
	
 	    СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
 		ПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();


	Если СчетЗатрат = ПустойСчет Тогда
		Возврат "";
	КонецЕсли;
	
	Рез = "";
	Если СчетЗатрат.ПринадлежитЭлементу(СчетУчетаРасчетов)
		Или СчетЗатрат.ПринадлежитЭлементу(СчетУчетаРасчетов)Тогда
		Рез = НСтр("ru='Услуги сторонних организаций';uk='Послуги сторонніх організацій'", КодЯзыкаПечать);
	Иначе
		Рез = СчетЗатрат.Наименование;
	КонецЕсли;
	
	Рез = Рез + НСтр("ru=' (сч. ';uk=' (рах. '", КодЯзыкаПечать) + СокрЛП(СчетЗатрат.Код) + ")";
	Возврат Рез;
  
КонецФункции

// Формируется список счетов учета номенклатуры, стоимость которой
// необходимо корректировать.
Функция СписокСчетовУчетаНоменклатуры(Учет, Организация = Неопределено, Период = Неопределено)
	
	ИмяПланаСчетов = "Хозрасчетный";
	
	СписокСчетов= Новый СписокЗначений;
	//СписокСчетов.Добавить(ПланыСчетов[ИмяПланаСчетов].ОборудованиеКУстановке);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОсновныхСредств);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеДругихНеоборотныхМатериальныхАктивов);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводственныеЗапасы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СырьеИМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеПолуфабрикатыИКомплектующиеИзделия);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Топливо);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТараИТарныеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СтроительныеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериалыПереданныеВПереработку);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ЗапасныеЧасти);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериалыСельскохозяйственногоНазначения);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ДругиеМатериалы);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.Товары);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счет)";
	Счета = Запрос.Выполнить().Выгрузить();
	Для Каждого Счет Из Счета Цикл
		Если (НЕ Счет.Ссылка = ПланыСчетов.Хозрасчетный.Товары) И
			(НЕ Счет.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВТорговле) И
			(НЕ Счет.Ссылка = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ) Тогда
					
			СписокСчетов.Добавить(Счет.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПродукцияСельскохозяйственногоПроизводства);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);
	
	Возврат СписокСчетов;
	
КонецФункции // МассивСчетовУчетаНоменклатуры()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
